#+title:      A Klasse 2023-27
#+date:       [2024-07-19 Fr 15:35]
#+filetags:   :2a:
#+identifier: 20240719T153525
#+CATEGORY: 2a
#+LANGUAGE: de
#+BIBLIOGRAPHY: ~/RoamNotes/references/Literatur.bib
#+SETUPFILE: ~/RoamNotes/config/latex_setup.org
#+ATTR_LATEX: :environment tabularx :placement [h] :center t :width linewidth
#+OPTIONS: num:nil toc:nil
#+STARTUP: fnadjust
#+STARTUP: showall
#+export_file_name: ~/RoamNotes/exports/2a.html

* Schülerliste
#+Name: 2021-students
| First     | Last       | Name               | Note | Mitarbeit | Heft | LZK |
|-----------+------------+--------------------+------+-----------+------+-----|
| Tobias    | Bernhofer  | [[Tobias Bernhofer][Tobias Bernhofer]]   |    1 |           |      |     |
| Alexander | Cerny      | [[Alexander Cerny][Alexander Cerny]]    |    1 |           |      |     |
| Laurin    | Ellmer     | [[Laurin Ellmer][Laurin Ellmer]]      |    1 |           |      |     |
| Amrit     | Gappmaier  | [[Amrit Gappmaier][Amrit Gappmaier]]    |    1 |           |      |     |
| Olivia    | Gappmaier  | [[Olivia Gappmaier][Olivia Gappmaier]]   |    1 |           |      |     |
| Nadine    | Gschiel    | [[Nadine Gschiel][Nadine Gschiel]]     |    1 |           |      |     |
| Damien    | Hettegger  | [[Damien Hettegger][Damien Hettegger]]   |    1 |           |      |     |
| Christian | Kronreif   | [[Christian Kronreif][Christian Kronreif]] |    1 |           |      |     |
| Rafael    | Lainer     | [[Rafael Lainer][Rafael Lainer]]      |    1 |           |      |     |
| Leopold   | Lechner    | [[Leopold Lechner][Leopold Lechner]]    |    1 |           |      |     |
| Hannah    | Lutje      | [[Hannah Lutje][Hannah Lutje]]       |    1 |           |      |     |
| Leonhard  | Malter     | [[Leonhard Malter][Leonhard Malter]]    |    1 |           |      |     |
| Sunmaya   | Marek      | [[Sunmaya Marek][Sunmaya Marek]]      |    1 |           |      |     |
| Khushboo  | Markandey  | [[Khushboo Markandey][Khushboo Markandey]] |    1 |           |      |     |
| Moritz    | Neuhofer   | [[Moritz Neuhofer][Moritz Neuhofer]]    |    1 |           |      |     |
| Heidi     | Pichler    | [[Heidi Pichler][Heidi Pichler]]      |    1 |           |      |     |
| Jakob     | Salchegger | [[Jakob Salchegger][Jakob Salchegger]]   |    1 |           |      |     |
| Elias     | Schieferer | [[Elias Schieferer][Elias Schieferer]]   |    1 |           |      |     |
| Nikolaj   | Schwaiger  | [[Nikolaj Schwaiger][Nikolaj Schwaiger]]  |    1 |           |      |     |
| Florian   | Siller     | [[Florian Siller][Florian Siller]]     |    1 |           |      |     |
| Michael   | Steiner    | [[Michael Steiner][Michael Steiner]]    |    1 |           |      |     |
| Pascal    | Stippler   | [[Pascal Stippler][Pascal Stippler]]    |    1 |           |      |     |
| Alexander | Wenger     | [[Alexander Wenger][Alexander Wenger]]   |    1 |           |      |     |
| Oskar     | Wieser     | [[Oskar Wieser][Oskar Wieser]]       |    1 |           |      |     |
| Veit      | Zierfuß    | [[Veit Zierfuß][Veit Zierfuß]]       |    1 |           |      |     |
|-----------+------------+--------------------+------+-----------+------+-----|
#+TBLFM: $4=vmean($5..$>);%.0f
#+TBLFM: $3='(concat "[[" $1 " " $2 "][" $1 " " $2 "]]")
#+TBLFM: $5='(identity remote(Mitarbeit,@@#$2))

#+BIND: org-export-filter-timestamp-functions (tmp-f-timestamp)
#+BIND: org-export-filter-strike-through-functions (tmp-f-strike-through)
#+BEGIN_SRC emacs-lisp :exports results :results none
  (defun tmp-f-timestamp (s backend info)
    (replace-regexp-in-string "&[lg]t;\\|[][]" "" s))
  (defun tmp-f-strike-through (s backend info) "")
#+END_SRC


#+BEGIN_SRC python :var table=2021-students :results output raw
  print('* Mitarbeit')
  for student in table:
      first = student[0]
      last = student[1]
      email = first + '.' + last + '@golling.schule'
      print('** ' + first + ' ' + last + '')
      print(':PROPERTIES:')
      print(':EMAIL: ' '[[mailto: ' + first + ' ' + last + ' <' + email + '>]]')
      print(':EXPORT_FILE_NAME: ' '~/RoamNotes/exports/'  + first +  '_'  + last +  '.html')
      print(':ID: ' + first + '' + last + '')
      print(':END: ')
      print('#+Name: Note_' + first + '' + last + '')
      print('|-----------------------+-------+-------------+-----+-----------+------------|')
      print('| Datum                 | Topic | Heft / Buch | LZK | Mitarbeit | Gesamtnote |')
      print('|-----------------------+-------+-------------+-----+-----------+------------|')
      print('|                       |       |             |     |           |            |')
      print('#+TBLFM: $6=vmean($3..$5);%.0f')
      print('\n')
#+END_SRC

#+RESULTS:
** Tobias Bernhofer
:PROPERTIES:
:EMAIL: [[mailto: Tobias Bernhofer <Tobias.Bernhofer@golling.schule>]]
:EXPORT_FILE_NAME: ~/RoamNotes/exports/Tobias_Bernhofer.html
:ID: TobiasBernhofer
:END: 
#+Name: Note_TobiasBernhofer
|-----------------------+-------+-------------+-----+-----------+------------|
| Datum                 | Topic | Heft / Buch | LZK | Mitarbeit | Gesamtnote |
|-----------------------+-------+-------------+-----+-----------+------------|
|                       |       |             |     |           |          0 |
| [2024-07-20 Sa 18:00] | Kap 1 |           1 |   2 |         1 |          1 |
| [2024-07-20 Sa 19:00] | Kap 2 |           1 |   2 |         3 |          2 |
| [2024-07-20 Sa 20:00] | Kap 3 |           1 |   2 |         1 |          1 |
#+TBLFM: $6=vmean($3..$5);%.0f

